import Mock from "mockjs"


function getResponse() {
  return {
    code: 200,
    data: {
      cities: ['深圳', '成都', '青岛', '北京', '宁波', '武汉', '厦门', '昆明', '上海', '广州', '株洲', '珠海', '温州', '苏州', '宝鸡', '太原', '包头', '银川', '九江', '连云港'],
      values: [76.02, 71.76, 71.48, 70.32, 67.42, 66.73, 60.6, 60.3, 60.08, 59.16, 51.18, 45.78, 43.58, 41.8, 39.67, 37.71, 35.73, 34.19, 30.35, 25.06]
    },
    msg: 'ok'
  }
}

const data = (option) => {
  return getResponse()
}
// 使用正则进行匹配，获取url参数
Mock.mock(/\/mock\/getAllCityIndex/, "get", data)


[2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020]
