import Mock from "mockjs"


function getResponse() {
  return {
    code: 200,
    data:
    {
      "nameArr": ["碳达峰目标", "碳中和相关目标", "试点示范建设", "统计核算披露", "节能环保投入占比", "人均碳排放量", "单位GDP碳排放量", "二产占比", "人均公共交通车辆拥有量", "新能源车渗透率", "垃圾分类指数", "全社会电力消耗强度", "非化石能源消费占比", "碳排放趋势检验", "碳排放脱钩指数", "碳排放量变化率"],
      "qzArr": [0.135, 0.015, 0.060, 0.060, 0.030, 0.048, 0.072, 0.080, 0.016, 0.048, 0.016, 0.036, 0.084, 0.150, 0.120, 0.030],
      "seriesData": [84.00, 20.00, 60.00, 30.00, 30.23, 25.03, 60.63, 74.87, 80.21, 38.00, 49.06, 79.32, 8.12, 0.00, 47.00, 34.00]
    },
    msg: 'ok'
  }
}

const data = (option) => {
  return getResponse()
}
// 使用正则进行匹配，获取url参数
Mock.mock(/\/mock\/index/, "get", data)


[2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020]
